Autodesk.Revit.DB.Extrusion.EndOffset
The offset of the end of the extrusion relative to the sketch plane.
Remarks: The direction of the offset is based on the normal of the extrusion's sketch
plane: a positive value is in the direction of the normal, a negative value is in the
other direction.

Autodesk.Revit.DB.Extrusion.StartOffset
The offset of the start of the extrusion relative to the sketch plane.
Remarks: The direction of the offset is based on the normal of the extrusion's sketch
plane: a positive value is in the direction of the normal, a negative value is in the
other direction.

Autodesk.Revit.DB.Extrusion.Sketch
Returns the Sketch of the Extrusion.
Remarks: This property is used to retrieve the Sketches of the Extrusion.

Autodesk.Revit.DB.Extrusion
A extrusion solid or void form.